Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
infra-flash-commit:57dbb8c 

Backend config changed or missing. Reinitializing...


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.http.casdoor_oidc_discovery[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "casdoor_oidc_discovery" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + request_headers      = {
          + "Accept" = "application/json"
        }
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = "https://sso.zitian.party/.well-known/openid-configuration"
    }

  # restapi_object.app_dashboard_oidc[0] will be updated in-place
~ resource "restapi_object" "app_dashboard_oidc" {
      ~ data            = (sensitive value)
        id              = "dashboard-oidc"
        # (9 unchanged attributes hidden)
    }

  # restapi_object.app_kubero_oidc[0] will be updated in-place
~ resource "restapi_object" "app_kubero_oidc" {
      ~ data            = (sensitive value)
        id              = "kubero-oidc"
        # (9 unchanged attributes hidden)
    }

  # restapi_object.app_portal_gate[0] will be updated in-place
~ resource "restapi_object" "app_portal_gate" {
      ~ data            = (sensitive value)
        id              = "portal-gate"
        # (9 unchanged attributes hidden)
    }

  # restapi_object.app_vault_oidc[0] will be updated in-place
~ resource "restapi_object" "app_vault_oidc" {
      ~ data            = (sensitive value)
        id              = "vault-oidc"
        # (9 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.

Changes to Outputs:
~ sso_e2e_status                 = {
      ~ oidc_discovery = "200" -> (known after apply)
        # (2 unchanged attributes hidden)
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 0 to add, 4 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`